app/controllers/accounts_controller.rb

  def create
    @account = Account.new account_params
    @account.active_status = 1
    if @account.save
---
INSERT INTO `accounts` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('admin', 'admin@gmail.com', '$2a$12$T140kTpCNS.z/azulr8uDOAurovG/BjGY0YZjyjezaWbPopHl3spi', '2020-01-07 09:07:03', '2020-01-07 09:07:03')