app/controllers/sessions_controller.rb

  def create
    account = Account.find_by(email: params[:account][:email].downcase)
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`email` = 'admin@gmail.com' LIMIT 1