app/controllers/static_pages_controller.rb

  def home
    @tour_items = Tour.all.paginate(page: params[:page], per_page: 6)
---
SELECT COUNT(*) FROM `tours`